Repository: hagege/child_themes
Catalog: plugins/shrinking-logo-sticky-header/languages/shrinking-logo-sticky-header-*_formal.po
Languages: de_de

source: Thanks a lot for using our Plugin. We would appreciate a review of the Plugin
de_de: Vielen Dank für die Verwendung unseres Plugins. Wir würden uns über eine Bewertung des Plugins freuen

source: Thanks a lot :-)
de_de: Vielen Dank :-)

source: Dynamic Header & Navigation for Block Themes – Settings: Version
de_de: Dynamic Header & Navigation for Block Themes - Einstellungen

source: Height of the shrunk header (px):
de_de: Höhe des geschrumpften Headers (px):

source: Disable inner spacing (padding) in header (may be helpful if the height of the shrinked header is very low)?
de_de: Innere Abstände (Padding) im Header deaktivieren (kann hilfreich sein, wenn die Höhe des geschrumpften Headers sehr gering ist)?

source: Animation duration (seconds):
de_de: Animationsdauer (Sekunden):

source: Normal height of header (px):
de_de: Normale Höhe des Headers (px):

source: Logo shrinking factor (Value in 0.05 steps):
de_de: Schrumpfungsfaktor des Logos (Wert in 0,05 Schritten):

source: Move the shrunk logo to the left (rem):
de_de: Das verkleinerte Logo nach links verschieben (rem):

source: Should the menu not be displayed as a sticky menu on mobile devices? – This can be helpful for accessibility reasons:
de_de: Soll das Menü auf Mobilgeräten nicht als Sticky-Menü angezeigt werden? – dies kann aus Gründen der Barrierefreiheit hilfreich sein:

source: Hide header on scroll down, show header on scroll up:
de_de: Kopfzeile beim Herunterscrollen ausblenden, Kopfzeile beim Hochscrollen anzeigen:

source: A breakpoint is a screen width where the website layout changes to adapt for different devices like mobiles or desktops. If the breakpoint remains set at 599px, then the breakpoint will be adopted by the theme without change.
de_de: Ein Breakpoint ist eine Bildschirmbreite, bei der sich das Layout der Website an verschiedene Geräte wie Mobiltelefone oder Desktop-Computer anpasst. Wenn der Breakpoint auf 599px festgelegt bleibt, wird er vom Theme unverändert übernommen.

source: Breakpoint Navigation (px) - Standard: 599:
de_de: Haltepunktnavigation (px) - Standard: 599:

source: Enable Text <Menu> below mobile Icon and display larger mobile menu Icon (Hamburger) - better for accessibility reasons:
de_de: Aktiviert den Text <Menu> unter dem mobilen Icon und zeigt ein größeres mobiles Menü-Icon (Hamburger) an - aus Gründen der Barrierefreiheit besser:

source: Label Text <Menu> (max. 6 characters):
de_de: Bezeichnung <Menu> (max. 6 Zeichen):

source: Off-canvas is a hidden navigation panel that slides in from the side of the screen, providing a space-saving way to access menu options without cluttering the main content area.
de_de: Off-Canvas ist ein verstecktes Navigationspanel, das von der Seite des Bildschirms eingeblendet wird und eine platzsparende Möglichkeit bietet, auf Menüoptionen zuzugreifen, ohne den Hauptinhaltsbereich zu überladen.

source: Activate Off-Canvas (CSS Rules):
de_de: Aktivierung Off-Canvas (CSS-Regeln):

source: Option for the speed of the Off-Canvas fade-in (Value in 0.1 steps - The smaller the value, the faster the fade-in):
de_de: Option für die Geschwindigkeit der Off-Canvas-Einblendung (Wert in 0,1 Schritten - je kleiner der Wert, desto schneller die Einblendung):

source: The header is normally transparent. However, you can set the background color for the header in the template part of your block theme (recommended). The background color for the header can also be set automatically using the following settings.
de_de: Die Kopfzeile ist normalerweise transparent. Sie können jedoch die Hintergrundfarbe für die Kopfzeile im Vorlagenteil ihres Block-Themes festlegen (empfohlen). Die Hintergrundfarbe für die Kopfzeile kann auch automatisch über die folgenden Einstellungen festgelegt werden.

source: Activate Background Color for Header (CSS Rules):
de_de: Aktivierung der Hintergrundfarbe (CSS-Regeln):

source: Animated shrinking header, responsive shrinking logo, custom breakpoints and off-canvas navigation – all-in-one navigation solution for most modern WordPress block themes.
de_de: Animierter schrumpfender Header, responsives schrumpfendes Logo, benutzerdefinierte Breakpoints und Off-Canvas-Navigation - eine Navigation-Komplettlösung für die meisten modernen WordPress-Block-Themes.
